Revit 2015 API
InternalDefinitions.Create Method
Creates a new parameter definition.
Overload List
Name | Description
Create(ExternalDefinitonCreationOptions)
Creates a new parameter definition using specified options.
 (Inherited from Definitions.)
Create(String, ParameterType) |  Obsolete.
Creates a new parameter definition using name and type.
 (Inherited from Definitions.)
Create(String, ParameterType, Boolean) |  Obsolete.
Creates a new parameter definition using name, type and visibility.
 (Inherited from Definitions.)
Create(String, ParameterType, Boolean, Guid) |  Obsolete.
Creates a new parameter definition using name, type, visibility and a specified Guid.
 (Inherited from Definitions.)
See Also
InternalDefinitions Class
InternalDefinitions Members
Autodesk.Revit.DB Namespace